In [3]:
import pandas as pd

tech_companies = {
    'brand': ['Apple', 'Google', 'Microsoft', 'Amazon', 'Facebook', 'Twitter', 'Alibaba', 'Tencent'],
    'founded': [1976, 1998, 1975, 1994, 2004, 2006, 1999, 1998],
    'ceo': ['Tim Cook', 'Sundar Pichai', 'Satya Nadella', 'Jeff Bezos', 'Mark Zuckerberg', 'Jack Dorsey', 'Daniel Zhang', 'Ma Huateng'],
    'industry': ['Hardware', 'Search Engine', 'Software', 'E-commerce', 'Social Media', 'Social Media', 'E-commerce', 'Social Media']
}

df = pd.DataFrame(tech_companies)
df

       brand  founded              ceo       industry
0      Apple     1976         Tim Cook       Hardware
1     Google     1998    Sundar Pichai  Search Engine
2  Microsoft     1975    Satya Nadella       Software
3     Amazon     1994       Jeff Bezos     E-commerce
4   Facebook     2004  Mark Zuckerberg   Social Media
5    Twitter     2006      Jack Dorsey   Social Media
6    Alibaba     1999     Daniel Zhang     E-commerce
7    Tencent     1998       Ma Huateng   Social Media

In [4]:
grouped = df.groupby('industry')
grouped.groups

{'E-commerce': [3, 6], 'Hardware': [0], 'Search Engine': [1], 'Social Media': [4, 5, 7], 'Software': [2]}

In [5]:
grouped.get_group('E-commerce') # .get_group('Something')

     brand  founded           ceo    industry
3   Amazon     1994    Jeff Bezos  E-commerce
6  Alibaba     1999  Daniel Zhang  E-commerce

In [6]:
# n = number of rows to return
df6 = df.sample(n=2)
df6

    brand  founded         ceo    industry
3  Amazon     1994  Jeff Bezos  E-commerce
0   Apple     1976    Tim Cook    Hardware

In [7]:
# frac means the fraction of rows to return
df7 = df.sample(frac=0.5)
df7

      brand  founded              ceo       industry
3    Amazon     1994       Jeff Bezos     E-commerce
5   Twitter     2006      Jack Dorsey   Social Media
1    Google     1998    Sundar Pichai  Search Engine
4  Facebook     2004  Mark Zuckerberg   Social Media

In [8]:
# DataFrame Left
left = pd.DataFrame({
    "A": ["A0", "A1", "A2"],
    "B": ["B0", "B1", "B2"]
}, index=["K0", "K1", "K2"])

# DataFrame right
right = pd.DataFrame({
    "C": ["C0", "C2", "C3"],
    "D": ["D0", "D2", "D3"]
}, index=["K0", "K2", "K3"])

# no axis specified, so it will concatenate vertically
concat = pd.concat([left, right])
concat

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2  NaN  NaN
K0  NaN  NaN   C0   D0
K2  NaN  NaN   C2   D2
K3  NaN  NaN   C3   D3

In [9]:
# Axis=0 means concatenate vertically
concat1 = pd.concat([left, right], axis=0)
concat1

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2  NaN  NaN
K0  NaN  NaN   C0   D0
K2  NaN  NaN   C2   D2
K3  NaN  NaN   C3   D3

In [10]:
# Axis=1 means concatenate horizontally
concat2 = pd.concat([left, right], axis=1)
concat2

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [11]:
# Create a DataFrame for employees
df_employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'department': ['HR', 'IT', 'Finance', 'Marketing']
})

# Create a DataFrame for salaries
df_salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 4],
    'salary': [70000, 80000, 90000, 85000]
})

print('Employee DataFrame')
print(df_employees)

print('Salaries DataFrame')
print(df_salaries)

# Merge the DataFrames
df_merged = pd.merge(df_employees, df_salaries, on='employee_id')
df_merged

Employee DataFrame
   employee_id     name department
0            1    Alice         HR
1            2      Bob         IT
2            3  Charlie    Finance
3            4    David  Marketing
Salaries DataFrame
   employee_id  salary
0            1   70000
1            2   80000
2            3   90000
3            4   85000

   employee_id     name department  salary
0            1    Alice         HR   70000
1            2      Bob         IT   80000
2            3  Charlie    Finance   90000
3            4    David  Marketing   85000

In [12]:
df1 = pd.DataFrame({'Courses': ["Spark", "PySpark", "Python", "pandas"],
                    'Fee': [20000, 25000, 22000, 24000]},
                   index=['r1', 'r2', 'r3', 'r4'])

df2 = pd.DataFrame({'Duration': ['30day', '40days', '35days', '60days', '55days'],
                    'Discount': [1000, 2300, 2500, 2000, 3000]},
                   index=['r1', 'r2', 'r3', 'r5', 'r6'])

print('DataFrame 1')
print(df1)
print()
print('DataFrame 2')
print(df2)

# Merge two DataFrames by index using pandas.merge()
result = pd.merge(df1, df2, left_index=True, right_index=True)
result

DataFrame 1
    Courses    Fee
r1    Spark  20000
r2  PySpark  25000
r3   Python  22000
r4   pandas  24000

DataFrame 2
   Duration  Discount
r1    30day      1000
r2   40days      2300
r3   35days      2500
r5   60days      2000
r6   55days      3000

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Python  22000   35days      2500

In [13]:
left = pd.DataFrame({"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"])
right = pd.DataFrame({"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"])

print('left')
print(left)
print()
print('right')
print(right)

result = left.join(right)
result

left
     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

right
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [14]:
left = pd.DataFrame(
 { "A": ["A0", "A1", "A2", "A3"],
   "B": ["B0", "B1", "B2", "B3"],
   "key": ["K0", "K1", "K0", "K1"], })
right = pd.DataFrame({"C": ["C0", "C1"], "D": ["D0", "D1"]}, index=["K0", "K1"])

print('left')
print(left)
print()
print('right')
print(right)

result = left.join(right, on="key")
result

left
    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K0
3  A3  B3  K1

right
     C   D
K0  C0  D0
K1  C1  D1

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1